# Joins y merge

Este notebook es un pequeño recurso para entender cómo funcionan los [joins](https://es.wikipedia.org/wiki/Join) o merge en Python Pandas. Tenemos dos tablas, una con estudiantes y otra con notas de sus exámenes. En ambas, la columna que nos permite realizar la unión es el DNI del estudiante.[Wikipedia](https://es.wikipedia.org/wiki/Join) tinee un buen articulo sobre el tema.

In [1]:
import pandas as pd

In [2]:
#siempre consulten la ayuda, es muy util
pd.merge?

In [3]:
#creamos los datos originales
alumnos = pd.DataFrame({'DNI':[123,456,789],
                        'nombre':['Ana','Juan','Pedro']})

notas = pd.DataFrame({'DNI':[123,123,456,111],
                      'materia':['Fisica','Matematica','Castellano','Castellano']})
alumnos

   DNI nombre
0  123    Ana
1  456   Juan
2  789  Pedro

In [4]:
#no esta pedro, ya que no esta su dni con notas en la tabla de notas. Puede no haber cursado o es un error en los datos
pd.merge(alumnos,notas,on='DNI',how='inner')

   DNI nombre     materia
0  123    Ana      Fisica
1  123    Ana  Matematica
2  456   Juan  Castellano

In [5]:
#esta pedro con missing, al decir left indicamos que queremos quedarnos con todos los registros de esa tabla
#en nuestro caso con todos los estudiantes, tengan nota o no
pd.merge(alumnos,notas,on='DNI',how='left')

   DNI nombre     materia
0  123    Ana      Fisica
1  123    Ana  Matematica
2  456   Juan  Castellano
3  789  Pedro         NaN

In [6]:
#tenemos un alumno que no sabemos su nota. Puede ser un error o un estudiante de otra institucion que no aparece en nuestros registros
pd.merge(alumnos,notas,on='DNI',how='right')

   DNI nombre     materia
0  123    Ana      Fisica
1  123    Ana  Matematica
2  456   Juan  Castellano
3  111    NaN  Castellano

In [7]:
#me trae los faltantes 
pd.merge(alumnos,notas,on='DNI',how='outer')

   DNI nombre     materia
0  123    Ana      Fisica
1  123    Ana  Matematica
2  456   Juan  Castellano
3  789  Pedro         NaN
4  111    NaN  Castellano

In [8]:
#tambien se puede realizar del siguiente modo, con un metodo sobre el objeto alumnos (que funciona como 'left')
alumnos.merge(notas,on='DNI',how='left')

   DNI nombre     materia
0  123    Ana      Fisica
1  123    Ana  Matematica
2  456   Juan  Castellano
3  789  Pedro         NaN

In [9]:
#si el nombre del campo es el mismo en ambas tablas, y se acepta que el join se realice con el método inner (por defecto)
#se puede realizar del siguiente modo
alumnos.merge(notas)

   DNI nombre     materia
0  123    Ana      Fisica
1  123    Ana  Matematica
2  456   Juan  Castellano